Revit 2024 API
Opening.Host Property
Retrieves the host element of this opening.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Element Host { get; }
Visual Basic
Public ReadOnly Property Host As Element
	Get
Visual C++
public:
property Element^ Host {
	Element^ get ();
}
See Also
Opening Class
Autodesk.Revit.DB Namespace